tap "elastic/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Interface bandwidth monitor
brew "bmon"
# Library for manipulating PNG images
brew "libpng"
# Manage compile and link flags for libraries
brew "pkg-config"
# GNU Emacs text editor
brew "emacs"
# Emacs dependency management
brew "cask"
# GNU compiler collection
brew "gcc"
# Cross-platform make
brew "cmake"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Image manipulation library
brew "jpeg"
# TIFF library and utilities
brew "libtiff"
# H.264/AVC encoder
brew "x264"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Distributed revision control system
brew "git"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Simplified Go project management, dependency management, and vendoring
brew "glide"
# Kubernetes package manager
brew "helm"
# Improved top (interactive process viewer)
brew "htop"
# Display an interface's bandwidth usage
brew "iftop"
# High dynamic-range image file format
brew "openexr", link: false
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Tool to measure maximum TCP and UDP bandwidth
brew "iperf"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Run a Kubernetes cluster locally
brew "minikube"
# Netwide Assembler (NASM) is an 80x86 assembler
brew "nasm"
# Realtime console network usage monitor
brew "nload"
# Network Time Protocol (NTP) Distribution
brew "ntp"
# Package for scientific computing with Python
brew "numpy", link: false
# Open source computer vision library
brew "opencv"
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# SVG to PNG converter
brew "svg2png"
# Command-line packet analyzer
brew "tcpdump"
# Traceroute implementation using TCP packets
brew "tcptraceroute"
# User interface to the TELNET protocol
brew "telnet"
# Terminal multiplexer
brew "tmux"
# Manage complex tmux sessions easily
brew "tmuxinator"
# Internet file retriever
brew "wget"
# Download YouTube videos from the command-line
brew "youtube-dl"
cask "font-hack-nerd-font"
cask "mark-text"
cask "tftpserver"
